Revit 2026 API

# FormatOptions(FormatOptions) Constructor

---

Creates a copy of a FormatOptions object.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FormatOptions(
	FormatOptions other
)
```
```vb
Public Sub New (
	other As FormatOptions
)
```
```cpp
public:
FormatOptions(
	FormatOptions^ other
)
```
```fsharp
new :
        other : FormatOptions -> FormatOptions
```

#### Parameters

other FormatOptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

FormatOptions Class

FormatOptions Overload

Autodesk.Revit.DB Namespace